# Module 2 Exercises - Explore Data

### Exercise 1:
Use the pandas library to read in the file "travel-times.csv" as a dataframe. Set the dataframe's variable name as "travel_df".

*Note*: Download the file from [here](https://notebooks.azure.com/priesterkc/projects/DABmaterial/tree/Lv1%20Data%20Analytics/datasets).

In [26]:
#import libraries
import pandas as pd
import numpy as np

travel_df = pd.read_csv("datasets_travel-times.csv")

In [27]:
#load travel-times.csv file
location = "datasets/datasets_travel-times.csv"
df = pd.read_csv(location)

In [9]:
travel_df = df

### Exercise 2:

Use the pandas library to read in the file "income_expenses.xlsx" as a dataframe. Set the dataframe's variable name as "expense_df".

*Note*: Download the file from [here](https://notebooks.azure.com/priesterkc/projects/DABmaterial/tree/Lv1%20Data%20Analytics/datasets).

In [21]:
#import libraries
import pandas as pd

#import Excel file

location = "datasets/datasets_income_expenses.xlsx"
df = pd.read_excel(location) #overwrites the info from the df variable in the examples above
df.head()

  Income Range                    Category  Amount Class_level
0     $100-200                        Rent   26.43        Poor
1     $100-200                        Food   59.81        Poor
2     $100-200                     Clothes   38.95        Poor
3     $100-200                       Taxes    0.14        Poor
4     $100-200  Other Expenses and Savings   13.77        Poor

In [24]:
expense_df = df

In [28]:
#add header after load data
expense_df.columns = ['student income', 'Expense', 'amount', 'class level']

### Exercise 3:
Using the lists in the cell below, write code that will zip up the lists and make them into one list, then turn it into a dataframe. Next, export the dataframe as a csv file. Then try exporting the dataframe as an Excel file.

In [2]:
df.columns = ['student income', 'Expense', 'amount', 'class level']

NameError: name 'df' is not defined

In [ ]:
names = ['Nike','Adidas','New Balance','Puma','Reebok']
grades = [176,59,47,38,99]

In [14]:
#load csv file data with headers

location = "datasets/smallgradesh.csv"
df = pd.read_csv(location)

In [29]:
#create data

names = ['Nike','Adidas','New Balance','Puma','Reebok']
grades = [176,59,47,38,99]
Final = list(zip(names,grades))

In [31]:
#export csv files

df = pd.DataFrame(data = Final, columns=['Names','Grades'])
df.to_csv('studentgrades.csv',index=False,header=False)

In [36]:
#save dataframe as Excel file

df = pd.DataFrame(data = Final, columns=['Names','Grades'])
writer = pd.ExcelWriter('studentgrades.xlsx', engine='xlsxwriter')
df.to_excel(writer, sheet_name='Sheet1')
writer.save()

### Exercise 4:

What columns are in the travel_df dataframe? What columns are in the expense_df dataframe?

In [37]:
#load expense_df file

travel_df.columns

Index(['Date', 'StartTime', 'DayOfWeek', 'GoingTo', 'Distance', 'MaxSpeed',
       'AvgSpeed', 'AvgMovingSpeed', 'FuelEconomy', 'TotalTime', 'MovingTime',
       'Take407All', 'Comments'],
      dtype='object')

In [38]:
expense_df.columns

Index(['student income', 'Expense', 'amount', 'class level'], dtype='object')

### Exercise 5:

Using the expense_df dataframe, sum the expense amount using the group_by function by income range.

In [39]:
expense_df.describe()

           amount
count   35.000000
mean   106.287143
std    120.399752
min      0.000000
25%     31.890000
50%     65.070000
75%    152.425000
max    568.130000

In [40]:
expense_df.head()

  student income                     Expense  amount class level
0       $100-200                        Rent   26.43        Poor
1       $100-200                        Food   59.81        Poor
2       $100-200                     Clothes   38.95        Poor
3       $100-200                       Taxes    0.14        Poor
4       $100-200  Other Expenses and Savings   13.77        Poor

In [44]:
expense_df['amount'].groupby(expense_df['student income']).sum()

student income
$100-200      139.10
$1000+       1125.00
$200-300      249.45
$300-400      335.68
$400-500      433.82
$500-750      557.00
$750-1000     880.00
Name: amount, dtype: float64

### Exercise 6:

Using the travel_df dataframe and pivot_table function, get the average total time by day of the week and direction traveled (Home/GSK).

In [45]:
travel_df.head()

,Date,StartTime,DayOfWeek,GoingTo,Distance,MaxSpeed,AvgSpeed,AvgMovingSpeed,FuelEconomy,TotalTime,MovingTime,Take407All,Comments
0,1/6/2012,16:37,Friday,Home,51.29,127.4,78.3,84.8,NaN,39.3,36.3,No,NaN
1,1/6/2012,08:20,Friday,GSK,51.63,130.3,81.8,88.9,NaN,37.9,34.9,No,NaN
2,1/4/2012,16:17,Wednesday,Home,51.27,127.4,82.0,85.8,NaN,37.5,35.9,No,NaN
3,1/4/2012,07:53,Wednesday,GSK,49.17,132.3,74.2,82.9,NaN,39.8,35.6,No,NaN
4,1/3/2012,18:57,Tuesday,Home,51.15,136.2,83.4,88.1,NaN,36.8,34.8,No,NaN

In [46]:
pd.pivot_table(travel_df, index=['DayOfWeek', 'GoingTo'],values=['TotalTime'])

                   TotalTime
DayOfWeek GoingTo
Friday    GSK      37.628571
          Home     38.238462
Monday    GSK      44.747368
          Home     41.725000
Thursday  GSK      40.204167
          Home     42.345000
Tuesday   GSK      42.079167
          Home     42.962500
Wednesday GSK      42.087500
          Home     44.300000

### Exercise 7:

Choose either the travel_df or expense_df and do some exploratory analysis.

In [47]:
travel_df.pivot_table(index = ['GoingTo"], values = ["MaxSpeed"])

SyntaxError: EOL while scanning string literal (<ipython-input-47-2465a43f8c70>, line 1)